export interface FakeDataItem {
    title: string;
    items: FakeDataCategoryItem[];
}

export interface FakeDataCategoryItem {
    year: number
    text: string
}

export const fakeData: FakeDataItem[] = [
    {
        title: 'Кино',
        items: [
            {
                year: 1987,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                year: 1988,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
            {
                year: 1989,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                year: 1990,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                year: 1991,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
        ]
    },
    {
        title: 'Литература',
        items: [
            {
                year: 1992,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                year: 1993,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
            {
                year: 1994,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                year: 1995,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                year: 1996,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
            {
                year: 1997,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
        ]
    },
    {
        title: 'Наука',
        items: [
            {
                year: 1998,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                year: 2000,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
            {
                year: 2001,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                year: 2004,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                year: 2005,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
            {
                year: 2007,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
        ]
    },
    {
        title: 'Техника',
        items: [
            {
                year: 2008,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                year: 2010,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
            {
                year: 2011,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                year: 2012,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                year: 2013,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
        ]
    }
]